# Pandas

In [1]:
import pandas as pd

* Series
* Data Frame

In [2]:
a = pd.Series([])
b = pd.Series([1,2,33,47,58,100])
c = pd.Series((45,89,20,30,44))
d = pd.Series({'a':10,'b':15,'c':56,'d':99})

C:\Users\JECRC Alumni\AppData\Local\Temp\ipykernel_12960\1746593775.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  a = pd.Series([])

In [3]:
print(type(a))
print(type(b))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [4]:
a

Series([], dtype: float64)

In [5]:
b

0      1
1      2
2     33
3     47
4     58
5    100
dtype: int64

In [6]:
c

0    45
1    89
2    20
3    30
4    44
dtype: int64

In [7]:
d

a    10
b    15
c    56
d    99
dtype: int64

In [8]:
import pandas as pd
import numpy as np

In [9]:
n=np.array([1,2,3,4,40])

In [10]:
n

array([ 1,  2,  3,  4, 40])

In [11]:
x=pd.Series(n)

In [12]:
x

0     1
1     2
2     3
3     4
4    40
dtype: int32

In [13]:
type(x)

pandas.core.series.Series

In [14]:
b=pd.Series([1,2,[11,10],33,[12,23],47,58,100])

In [15]:
b

0           1
1           2
2    [11, 10]
3          33
4    [12, 23]
5          47
6          58
7         100
dtype: object

In [16]:
b[3:7]

3          33
4    [12, 23]
5          47
6          58
dtype: object

In [17]:
d=pd.Series({'a':10,'b':15,'c':56,'d':90})

In [18]:
d['d']

90

In [19]:
d['b':]

b    15
c    56
d    90
dtype: int64

In [20]:
s=pd.Series([12,52,42,10,23],index=['q','w','e','r','t'])

In [21]:
s

q    12
w    52
e    42
r    10
t    23
dtype: int64

In [22]:
s1=pd.Series([12,52,42,10,23],index=list('qwert'))

In [23]:
s1

q    12
w    52
e    42
r    10
t    23
dtype: int64

In [24]:
s2=pd.Series([12,52,12,52,10,23,42,10,23])

In [25]:
s2

0    12
1    52
2    12
3    52
4    10
5    23
6    42
7    10
8    23
dtype: int64

In [26]:
s2.value_counts()

12    2
52    2
10    2
23    2
42    1
dtype: int64

In [27]:
s2.argmax()

1

In [28]:
s2.argmin()

4

In [29]:
s.max()

52

In [30]:
s[1]

52

In [31]:
s1

q    12
w    52
e    42
r    10
t    23
dtype: int64

In [32]:
s1.idxmax()

'w'

In [33]:
s1.idxmin()

'r'

# Data Frame

In [34]:
a=pd.DataFrame()
b=pd.DataFrame([1,2,55,40,86])

In [35]:
a

Empty DataFrame
Columns: []
Index: []

In [36]:
b

    0
0   1
1   2
2  55
3  40
4  86

In [37]:
type(b)

pandas.core.frame.DataFrame

In [38]:
c=pd.DataFrame([[1,2,3],[10,20,30],[7,8,9]])

In [39]:
c

    0   1   2
0   1   2   3
1  10  20  30
2   7   8   9

In [40]:
c=pd.DataFrame([[1,2,3,4,5],[10,20,30,40,50],[7,8,9,10,11],[23,24,25,26,27],[1,2,3,4,5,]])

In [41]:
c

    0   1   2   3   4
0   1   2   3   4   5
1  10  20  30  40  50
2   7   8   9  10  11
3  23  24  25  26  27
4   1   2   3   4   5

In [42]:
c.head()

    0   1   2   3   4
0   1   2   3   4   5
1  10  20  30  40  50
2   7   8   9  10  11
3  23  24  25  26  27
4   1   2   3   4   5

In [43]:
c.tail()

    0   1   2   3   4
0   1   2   3   4   5
1  10  20  30  40  50
2   7   8   9  10  11
3  23  24  25  26  27
4   1   2   3   4   5

In [44]:
c.tail(3)

    0   1   2   3   4
2   7   8   9  10  11
3  23  24  25  26  27
4   1   2   3   4   5

In [45]:
c.head(3)

    0   1   2   3   4
0   1   2   3   4   5
1  10  20  30  40  50
2   7   8   9  10  11

In [46]:
c.sample()

   0  1  2  3  4
4  1  2  3  4  5

In [47]:
c.sample(5)

    0   1   2   3   4
4   1   2   3   4   5
3  23  24  25  26  27
1  10  20  30  40  50
2   7   8   9  10  11
0   1   2   3   4   5

In [48]:
c1=pd.DataFrame([[1,2],[10,20,30],[7,]])

In [49]:
c1

    0     1     2
0   1   2.0   NaN
1  10  20.0  30.0
2   7   NaN   NaN

In [50]:
c1[1][1]=np.nan

C:\Users\JECRC Alumni\AppData\Local\Temp\ipykernel_12960\3399341605.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  c1[1][1]=np.nan

In [51]:
c1[1][1]=np.nan

C:\Users\JECRC Alumni\AppData\Local\Temp\ipykernel_12960\3399341605.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  c1[1][1]=np.nan

In [52]:
c1

    0    1     2
0   1  2.0   NaN
1  10  NaN  30.0
2   7  NaN   NaN

In [53]:
c1[1][1]=np.nan

C:\Users\JECRC Alumni\AppData\Local\Temp\ipykernel_12960\3399341605.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  c1[1][1]=np.nan

In [54]:
c1

    0    1     2
0   1  2.0   NaN
1  10  NaN  30.0
2   7  NaN   NaN

In [55]:
c1=pd.DataFrame([[np.nan,'Missing',2],[10,20,30],[7,]])

In [56]:
c1

      0        1     2
0   NaN  Missing   2.0
1  10.0       20  30.0
2   7.0     None   NaN

In [57]:
c1=pd.DataFrame([[np.nan,'Missing',2],[10,20,30],[7,]],columns=['colA','colB','colC'])

In [58]:
c1

   colA     colB  colC
0   NaN  Missing   2.0
1  10.0       20  30.0
2   7.0     None   NaN

In [59]:
c1['colB']

0    Missing
1         20
2       None
Name: colB, dtype: object

In [60]:
c1[['colA','colB']]

   colA     colB
0   NaN  Missing
1  10.0       20
2   7.0     None

In [61]:
c1[['colA','colB']].head(3)

   colA     colB
0   NaN  Missing
1  10.0       20
2   7.0     None

In [62]:
c1[['colA','colB']][1:4]

   colA  colB
1  10.0    20
2   7.0  None

In [63]:
c1.shape

(3, 3)

In [64]:
c1['colA'].max()

10.0

In [65]:
c1['colA'].min()

7.0

In [66]:
c1['d']=list('123')

In [67]:
c1

   colA     colB  colC  d
0   NaN  Missing   2.0  1
1  10.0       20  30.0  2
2   7.0     None   NaN  3

In [68]:
c1['e']=[2,3,4]

In [69]:
c1

   colA     colB  colC  d  e
0   NaN  Missing   2.0  1  2
1  10.0       20  30.0  2  3
2   7.0     None   NaN  3  4

In [70]:
c1['colD'] = c1['d'] + c1['e']

TypeError: can only concatenate str (not "int") to str

In [ ]:
f=c1['d']>50

In [ ]:
f=c1['d']>1

In [ ]:
c1['d']

In [ ]:
c1['d']>1

In [ ]:
c1

In [ ]:
c1['d'].dtype

In [ ]:
c1['d']>0